name: "FaceAlignment"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {

    source: "wowoclass_shuffle_train.txt"
    batch_size: 96
    shuffle: true
    
  }
  transform_param {
    mean_value: 104.008
    mean_value: 116.669
    mean_value: 122.675
    crop_size: 128
    mirror: false
  }
  include: { phase: TRAIN}
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "wowoclass_shuffle_val.txt"
    batch_size: 10
    shuffle: false
  }
  transform_param {
    mean_value: 104.008
    mean_value: 116.669
    mean_value: 122.675
    crop_size: 128
    mirror: false
  }
  include: { phase: TEST}
}
layer {
    name: "conv1"
    type: "Convolution"
    bottom: "data"
    top: "conv1"
    convolution_param {
        num_output: 12
        kernel_size: 5
        stride: 4
    }
}

layer {
    name: "relu1"
    type: "ReLU"
    bottom: "conv1"
    top: "conv1"
}

layer {
    name: "conv2"
    type: "Convolution"
    bottom: "conv1"
    top: "conv2"
    convolution_param {
        num_output: 20
        kernel_size: 3
        stride: 2
    }
}

layer {
    name: "relu2"
    type: "ReLU"
    bottom: "conv2"
    top: "conv2"
}

layer {
    name: "conv3"
    type: "Convolution"
    bottom: "conv2"
    top: "conv3"
    convolution_param {
        num_output: 64
        kernel_size: 3
        stride: 2
    }
}

layer {
    name: "relu3"
    type: "ReLU"
    bottom: "conv3"
    top: "conv3"
}

layer {
    name: "conv4"
    type: "Convolution"
    bottom: "conv3"
    top: "conv4"
    convolution_param {
        num_output: 80
        kernel_size: 3
        stride: 2
        pad: 0
    }
}

layer {
    name: "relu4"
    type: "ReLU"
    bottom: "conv4"
    top: "conv4"
}

layer {
    name: "ip1"
    type: "InnerProduct"
    bottom: "conv4"
    top: "ip1"
    inner_product_param {
        num_output: 256
    }
}

layer {
    name: "relu5"
    type: "ReLU"
    bottom: "ip1"
    top: "ip1"
}

layer {
    name: "fc-head"
    type: "InnerProduct"
    bottom: "ip1"
    top: "fc-head"
    inner_product_param {
        num_output: 9
    }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc-head"
  bottom: "label"
  top: "loss"
  loss_param {
    ignore_label: 255
  }
  include: { phase: TRAIN}
  include: { phase: TEST}
}

layer {
  name: "loss-acc"
  type: "Accuracy"
  bottom: "fc-head"
  bottom: "label"
  top: "loss-acc"
  accuracy_param {
    ignore_label: 255
  }
  include: { phase: TRAIN}
  include: { phase: TEST}
}
